DLL-Binary-Components-SharedLibraries.org
#+INCLUDE: theme/style.org
#+TITLE: Shared Libraries - Binary Components
#+DESCRIPTION: cpp c++ code examples, demonstrations, design pattern and integration.
#+STARTUP: content 

 - [[wiki:index][Index]]

* Shared Libraries - Binary Components
** Overview 

Shared libraries are compiled object-code exporting functions, data
structures and classes which can be used by many different
programs. They provide many benefits such as: faster compilation time;
less disk space usage since each program using the library do not
need a copy of the library source code or its compiled-code; ability
to update the library and provide security fixes to client
applications without recompilation, just by replacing the library
file. 

On Windows, shared libraries are called DLLs which stands for Dynamic
Linked Libraries, on Unix-like operating systems such as Linux, BSD
and MacOSX, they are called SO - shared objects or DSO - dynamic
shared objects. 

#+CAPTION: Comparison of shared libraries across different operating systems 
| Operating | Long Name               | Short name | File          | Binary Format                         |
| System    |                         |            | Extension     |                                       |
|-----------+-------------------------+------------+---------------+---------------------------------------|
| Windows   | Dynamic Linked Library  | DLL        | .dll          | PE32/PE64 - Portable Executable       |
| Linux     | (Dynamic) Shared Object | DSO or SO  | .so           | ELF or ELF64 (for 64 bits processors) |
| BSD       | (Dynamic) Shared Object | DSO or SO  | .so           | ELF or ELF64                          |
| MacOSX    | -                       | dylib      | .dylib or .so | MachO                                 |
|-----------+-------------------------+------------+---------------+---------------------------------------|

 + Shared libraries are similar to executables, however they do not
   have the main() function entry point.

In addition to C and C++, shared libraries, containing functions with
C-linkage, can also be used as binary components (libraries) and be
consumed from higher level programming languages such as Python, Ruby,
Java or C# through some foreign-function interface. In Python
C-functions can be imported from shared libraries using the [[https://docs.python.org/3/library/ctypes.html][cytpes]]
library; in C# C-functions can be consumed using the P-invoke API and
in Java it is possible to use C-functions from shared libraries using
the JNI (Java Native Interface) or JNA, which is easier to use.

Note: 
 + Shared libraries are specific to a particular operating system and
   are not part of C++ standard.

** Example 1 - Shared Library libtest.dll - DLLs on Windows
*** Overview 

 *Source:*

Shared library Source Code

 + File: [[file:src/dlls/example-windows1/testlib.cpp][file:src/dlls/example-windows1/testlib.cpp]]
 + File: [[file:src/dlls/example-windows1/testlib.hpp][file:src/dlls/example-windows1/testlib.hpp]]

Sample Client C++ Program:

 + File: [[file:src/dlls/example-windows1/client1.cpp][file:src/dlls/example-windows1/client1.cpp]]  

GIST - Better for online view: 

 + [[https://gist.github.com/caiorss/2bba4c50866d9467aaa8c7792b337f71][Gisthub]]

 *Compile the DLL libtest.dll and client program with MSVC* 

Shared Library 

#+BEGIN_SRC cpp 
 $ cl.exe testlib.cpp /EHsc /LD /nologo user32.lib
#+END_SRC

C++ Client program (client code)

#+BEGIN_SRC cpp 
 $ cl.exe /EHsc client.cpp /Fe:out.exe testlib.lib && out.exe
#+END_SRC

 *Compile the DLL libtest.dll and client program with Mingw/GCC* 

Shared Library 

#+BEGIN_SRC cpp 
 $ g++ testlib.cpp -o testlib.dll -g -shared -std=c++14 -Wall
#+END_SRC

C++ Client program 

#+BEGIN_SRC cpp 
 $ g++ client.cpp -o client.exe -g -std=c++14 testlib.dll -Wall
#+END_SRC

*** Header macros 

Sources:
 + File: [[file:src/dlls/example-windows1/testlib.cpp][file:src/dlls/example-windows1/testlib.cpp]]
 + File: [[file:src/dlls/example-windows1/testlib.hpp][file:src/dlls/example-windows1/testlib.hpp]]

 *teslib.hpp / Heade File - Macros*

The header files uses the following macros to reduce the boilerplate
necessary to export the library functions and classes. 

 + file: libstes.hpp => Macros for exporting functions and classes. 

#+BEGIN_SRC cpp
  #ifndef _WIN32
    // If not compiled for Windows, remove declspec directive.
    #define __declspec(param)  
  #endif 

  #define EXPORT_CPP 	__declspec(dllexport)
 
  #ifdef __cplusplus
    // Indicat that a given symbol/function has C-linkage and
    // does not have name mangling. 
    #define EXPORT_C extern "C" __declspec(dllexport)
  #else
    // If a C-compiler uses this header, remove 'extern "C"'
    #define EXPORT_C  __declspec(dllexport)
  #endif 
#+END_SRC

