DLL-Binary-Components-SharedLibraries.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-16 Sun 23:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shared Libraries - Binary Components</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="cpp c++ code examples, demonstrations, design pattern and integration."
 />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="theme/org-nav-theme.css" rel="stylesheet">
<link rel="icon" href="favicon.ico" type="image/vnd.microsoft.icon" />
</head>
<body>
<div id="content">
<h1 class="title">Shared Libraries - Binary Components</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2357844">1. Shared Libraries - Binary Components</a>
<ul>
<li><a href="#org3862c41">1.1. Overview</a></li>
<li><a href="#orge74e65c">1.2. Example 1 - Shared Library libtest.dll - DLLs on Windows</a>
<ul>
<li><a href="#orge4f29fb">1.2.1. Overview</a></li>
<li><a href="#org1918479">1.2.2. Header macros</a></li>
<li><a href="#orge7aa1b9">1.2.3. Namespace Linalg</a></li>
<li><a href="#orgf9a9a38">1.2.4. C-interface of Namespace Linalg</a></li>
<li><a href="#org3087a08">1.2.5. Non-polymorphic Class - SampleClass</a></li>
<li><a href="#orga8aa558">1.2.6. C-interface for SampleClass</a></li>
<li><a href="#org9cdbf21">1.2.7. Polymorphic class InterfaceClass</a></li>
<li><a href="#orgbd82f75">1.2.8. DLL startup function DLLMain</a></li>
<li><a href="#orge33c919">1.2.9. DLL entry point for run32dll.exe</a></li>
<li><a href="#org91a7c35">1.2.10. C++ Client program - client1.cpp</a></li>
</ul>
</li>
<li><a href="#org7e05b65">1.3. <span class="todo TODO">TODO</span> Shared Libraries on Linux</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><a href='index.html'>Index</a></li>
</ul>

<div id="outline-container-org2357844" class="outline-2">
<h2 id="org2357844"><span class="section-number-2">1</span> Shared Libraries - Binary Components</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3862c41" class="outline-3">
<h3 id="org3862c41"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Shared libraries are compiled object-code exporting functions, data
structures and classes which can be used by many different
programs. They provide many benefits such as: faster compilation time;
less disk space usage since each program using the library do not
need a copy of the library source code or its compiled-code; ability
to update the library and provide security fixes to client
applications without recompilation, just by replacing the library
file. 
</p>

<p>
On Windows, shared libraries are called DLLs which stands for Dynamic
Linked Libraries, on Unix-like operating systems such as Linux, BSD
and MacOSX, they are called SO - shared objects or DSO - dynamic
shared objects. 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Comparison of shared libraries across different operating systems</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operating</th>
<th scope="col" class="org-left">Long Name</th>
<th scope="col" class="org-left">Short name</th>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-left">Binary Format</th>
</tr>

<tr>
<th scope="col" class="org-left">System</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Extension</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Windows</td>
<td class="org-left">Dynamic Linked Library</td>
<td class="org-left">DLL</td>
<td class="org-left">.dll</td>
<td class="org-left">PE32/PE64 - Portable Executable</td>
</tr>

<tr>
<td class="org-left">Linux</td>
<td class="org-left">(Dynamic) Shared Object</td>
<td class="org-left">DSO or SO</td>
<td class="org-left">.so</td>
<td class="org-left">ELF or ELF64 (for 64 bits processors)</td>
</tr>

<tr>
<td class="org-left">BSD</td>
<td class="org-left">(Dynamic) Shared Object</td>
<td class="org-left">DSO or SO</td>
<td class="org-left">.so</td>
<td class="org-left">ELF or ELF64</td>
</tr>

<tr>
<td class="org-left">MacOSX</td>
<td class="org-left">-</td>
<td class="org-left">dylib</td>
<td class="org-left">.dylib or .so</td>
<td class="org-left">MachO</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Shared libraries are similar to executables, however they do not
have the main() function entry point.</li>
</ul>

<p>
In addition to C and C++, shared libraries, containing functions with
C-linkage, can also be used as binary components (libraries) and be
consumed from higher level programming languages such as Python, Ruby,
Java or C# through some foreign-function interface. In Python
C-functions can be imported from shared libraries using the <a href="https://docs.python.org/3/library/ctypes.html">cytpes</a>
library; in C# C-functions can be consumed using the P-invoke API and
in Java it is possible to use C-functions from shared libraries using
the JNI (Java Native Interface) or JNA, which is easier to use.
</p>

<p>
Note: 
</p>
<ul class="org-ul">
<li>Shared libraries are specific to a particular operating system and
are not part of C++ standard.</li>
</ul>
</div>
</div>

<div id="outline-container-orge74e65c" class="outline-3">
<h3 id="orge74e65c"><span class="section-number-3">1.2</span> Example 1 - Shared Library libtest.dll - DLLs on Windows</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orge4f29fb" class="outline-4">
<h4 id="orge4f29fb"><span class="section-number-4">1.2.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<b>Source:</b>
</p>

<p>
Shared library Source Code
</p>

<ul class="org-ul">
<li>File: <a href="src/dlls/example-windows1/testlib.cpp">file:src/dlls/example-windows1/testlib.cpp</a></li>
<li>File: <a href="src/dlls/example-windows1/testlib.hpp">file:src/dlls/example-windows1/testlib.hpp</a></li>
</ul>

<p>
Sample Client C++ Program:
</p>

<ul class="org-ul">
<li>File: <a href="src/dlls/example-windows1/client1.cpp">file:src/dlls/example-windows1/client1.cpp</a></li>
</ul>

<p>
GIST - Better for online view: 
</p>

<ul class="org-ul">
<li><a href="https://gist.github.com/caiorss/2bba4c50866d9467aaa8c7792b337f71">Gisthub</a></li>
</ul>

<p>
<b>Compile the DLL libtest.dll and client program with MSVC</b> 
</p>

<p>
Shared Library 
</p>

<div class="org-src-container">
<pre class="src src-cpp">$ cl.exe testlib.cpp /EHsc /LD /nologo user32.lib
</pre>
</div>

<p>
C++ Client program (client code)
</p>

<div class="org-src-container">
<pre class="src src-cpp">$ cl.exe /EHsc client.cpp /Fe:out.exe testlib.lib &amp;&amp; out.exe
</pre>
</div>

<p>
<b>Compile the DLL libtest.dll and client program with Mingw/GCC</b> 
</p>

<p>
Shared Library 
</p>

<div class="org-src-container">
<pre class="src src-cpp">$ g++ testlib.cpp -o <span class="org-keyword">testlib.dll</span> -g -shared -std=c++14 -Wall
</pre>
</div>

<p>
C++ Client program 
</p>

<div class="org-src-container">
<pre class="src src-cpp">$ g++ client.cpp -o <span class="org-keyword">client.exe</span> -g -std=c++14 testlib.dll -Wall
</pre>
</div>
</div>
</div>

<div id="outline-container-org1918479" class="outline-4">
<h4 id="org1918479"><span class="section-number-4">1.2.2</span> Header macros</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Sources:
</p>
<ul class="org-ul">
<li>File: <a href="src/dlls/example-windows1/testlib.cpp">file:src/dlls/example-windows1/testlib.cpp</a></li>
<li>File: <a href="src/dlls/example-windows1/testlib.hpp">file:src/dlls/example-windows1/testlib.hpp</a></li>
</ul>

<p>
<b>teslib.hpp / Heade File - Macros</b>
</p>

<p>
The header files uses the following macros to reduce the boilerplate
necessary to export the library functions and classes. 
</p>

<ul class="org-ul">
<li>file: libstes.hpp =&gt; Macros for exporting functions and classes.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#if</span><span class="org-negation-char"><span class="org-preprocessor">n</span></span><span class="org-preprocessor">def</span> _WIN32
  <span class="org-comment-delimiter">// </span><span class="org-comment">If not compiled for Windows, remove declspec directive.</span>
<span class="org-preprocessor">  #define</span> <span class="org-function-name">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">param</span><span class="org-rainbow-delimiters-depth-1">)</span>  
<span class="org-preprocessor">#endif</span> 

<span class="org-preprocessor">#define</span> <span class="org-variable-name">EXPORT_CPP</span>  <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-preprocessor">#ifdef</span> __cplusplus
  <span class="org-comment-delimiter">// </span><span class="org-comment">Indicat that a given symbol/function has C-linkage and</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">does not have name mangling. </span>
<span class="org-preprocessor">  #define</span> <span class="org-variable-name">EXPORT_C</span> <span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-preprocessor">#else</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">If a C-compiler uses this header, remove 'extern "C"'</span>
<span class="org-preprocessor">  #define</span> <span class="org-variable-name">EXPORT_C</span>  <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-preprocessor">#endif</span> 
</pre>
</div>
</div>
</div>
