DLL-Binary-Components-SharedLibraries.org
*** Namespace Linalg 

 *Functions of Namespace Linalg* 

Namespace containing sample linear algebra functions, the function norm
computes an Euclidean norm of a N-dimension vector, the function
linTransform computes a linear transformation performing the
computation v[i] * a + b for each vector element. 

On Windows, all DLL symbols, such as functions, variables and clases,
are private by default, they are not exported by default as happens in
Unix-like OSes shared libraries. Therefore, in order to a function be
exported in a Windows shared library, it is necessary to use the MSVC or visual C++
compiler extension ~__declspec(dllexport)~ before the function declaration.
 
 + Interface => File: *testlib.hpp*

#+BEGIN_SRC cpp 
  /** The macro __cplusplus is used for allowing this 
   ,* header to be used from 'C'. If a C compiler is used
   ,* all definitions inside this #ifdef are discarded.
   ,*/
  #ifdef __cplusplus
  namespace Linalg {
          EXPORT_CPP double norm(const std::vector<double>& xs);

          EXPORT_CPP std::vector<double> linTransform(
                  double a,
                  double b,
                  std::vector<double>& xs
                  );

          EXPORT_CPP
          std::ostream&
          printVector(std::ostream& os, std::vector<double>& xs);	
  }
  #endif 
#+END_SRC

The macro ~EXPORT_CPP~ expands to: 

#+BEGIN_SRC cpp
  EXPORT_CPP double norm(const std::vector<double>& xs);
  // Macro EXPORT_CPP expansion 
  __declspec(dllexport) double norm(const std::vector<double>& xs);
#+END_SRC

The compiler directives *#ifdef __cplusplus ... #endif* are used for
disabling this code block when the header is used by a C-compiler as
the C-language does not support classes, namespaces and many other C++
features. 

 + Implementation => file: *testlib.cpp*

#+BEGIN_SRC cpp 
   // Linear algebra tools 
   namespace Linalg{
        __declspec(dllexport)
        double norm(const std::vector<double>& xs){
           double sum = 0.0;
           for(const auto& x : xs) sum += x * x;
               return std::sqrt(sum);
        }

         __declspec(dllexport)
        std::vector<double>
        linTransform(double a, double b, std::vector<double>& xs){
            std::vector<double> out(xs.size());
            ... ... .... 
        }

       ... ... 
   }
#+END_SRC

