DLL-Binary-Components-SharedLibraries.html

<div id="outline-container-orge7aa1b9" class="outline-4">
<h4 id="orge7aa1b9"><span class="section-number-4">1.2.3</span> Namespace Linalg</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
<b>Functions of Namespace Linalg</b> 
</p>

<p>
Namespace containing sample linear algebra functions, the function norm
computes an Euclidean norm of a N-dimension vector, the function
linTransform computes a linear transformation performing the
computation v[i] * a + b for each vector element. 
</p>

<p>
On Windows, all DLL symbols, such as functions, variables and clases,
are private by default, they are not exported by default as happens in
Unix-like OSes shared libraries. Therefore, in order to a function be
exported in a Windows shared library, it is necessary to use the MSVC or visual C++
compiler extension <code>__declspec(dllexport)</code> before the function declaration.
</p>

<ul class="org-ul">
<li>Interface =&gt; File: <b>testlib.hpp</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/** </span><span class="org-comment">The macro __cplusplus is used for allowing this </span>
<span class="org-comment"> * header to be used from 'C'. If a C compiler is used</span>
<span class="org-comment"> * all definitions inside this #ifdef are discarded.</span>
<span class="org-comment"> */</span>
<span class="org-preprocessor">#ifdef</span> __cplusplus
<span class="org-keyword">namespace</span> <span class="org-constant">Linalg</span> <span class="org-rainbow-delimiters-depth-1">{</span>
        EXPORT_CPP <span class="org-type">double</span> <span class="org-function-name">norm</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>&amp; <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-2">)</span>;

        EXPORT_CPP <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-function-name">linTransform</span><span class="org-rainbow-delimiters-depth-2">(</span>
                <span class="org-type">double</span> <span class="org-variable-name">a</span>,
                <span class="org-type">double</span> <span class="org-variable-name">b</span>,
                <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>&amp; <span class="org-variable-name">xs</span>
                <span class="org-rainbow-delimiters-depth-2">)</span>;

        EXPORT_CPP
        <span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp;
        <span class="org-function-name">printVector</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp; <span class="org-variable-name">os</span>, <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>&amp; <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-2">)</span>; 
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-preprocessor">#endif</span> 
</pre>
</div>

<p>
The macro <code>EXPORT_CPP</code> expands to: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">EXPORT_CPP <span class="org-type">double</span> <span class="org-function-name">norm</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>&amp; <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Macro EXPORT_CPP expansion </span>
<span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-type">double</span> <span class="org-function-name">norm</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>&amp; <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
The compiler directives <b>#ifdef __cplusplus &#x2026; #endif</b> are used for
disabling this code block when the header is used by a C-compiler as
the C-language does not support classes, namespaces and many other C++
features. 
</p>

<ul class="org-ul">
<li>Implementation =&gt; file: <b>testlib.cpp</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Linear algebra tools </span>
<span class="org-keyword">namespace</span> <span class="org-constant">Linalg</span><span class="org-rainbow-delimiters-depth-1">{</span>
     <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-2">(</span>dllexport<span class="org-rainbow-delimiters-depth-2">)</span>
     <span class="org-type">double</span> <span class="org-function-name">norm</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>&amp; <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-2">){</span>
        <span class="org-type">double</span> <span class="org-variable-name">sum</span> = 0.0;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span> : xs<span class="org-rainbow-delimiters-depth-3">)</span> sum += x * x;
            <span class="org-keyword">return</span> <span class="org-constant">std</span>::sqrt<span class="org-rainbow-delimiters-depth-3">(</span>sum<span class="org-rainbow-delimiters-depth-3">)</span>;
     <span class="org-rainbow-delimiters-depth-2">}</span>

      <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-2">(</span>dllexport<span class="org-rainbow-delimiters-depth-2">)</span>
     <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>
     <span class="org-function-name">linTransform</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span>, <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>&amp; <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-2">){</span>
         <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-variable-name">out</span><span class="org-rainbow-delimiters-depth-3">(</span>xs.size<span class="org-rainbow-delimiters-depth-4">()</span><span class="org-rainbow-delimiters-depth-3">)</span>;
         ... ... .... 
     <span class="org-rainbow-delimiters-depth-2">}</span>

    ... ... 
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
