DLL-Binary-Components-SharedLibraries.org
*** C-interface of Namespace Linalg 

 *C-interface of Namespace Linalg* 

A C-interface is necessary for ensuring that the DLL can be called
from a C-program or a foreign function interface of a higher level
language. 

 + File: *testlib.hpp* => Function declaration. 

#+BEGIN_SRC cpp 
  // ======= C-interface for Linalg namespace =========//
  /* ----- C-Wrappers for Linalg namespace ---- */

  /** Handle or opaque pointer for std::vector<double> */
  typedef void* hVectorD;

  extern "C"  __declspec(dllexport)
  double testlib_vectorD_Linalg_norm(hVectorD hv);

  extern "C"  __declspec(dllexport)
  void testlib_vectorD_Linalg_printVector(const char* name, hVectorD hv);
#+END_SRC

The *extern "C"* statements are necessary to compile the functions with
_C-linkage_, it means without _name mangling_ (aka name decoration). In
every C program, the function symbols are generally the same as their
names. However, as C++ supports templates and function overloading,
many functions can have the same, with different type signatures,
C++ compiler mangles or decorates function names with a different
schema to make the symbol unique. 

Functions with C-linkage, can only use C-compatible types or PODs
types (Plain Old Data). Therefore, they cannot use STL container,
std::vector, std::string and so on. 

The statement ~__declspec(dllexport)~ is necessary to make annotated
functions' symbols visible. On Unix-like systems and Linux, it is not
necessary as it is MSVC (cl.exe) compiler extension. 


 + File: *testlib.cpp* => C-interface function implementations. 

The type synonym hVectorD is handle or a opaque poiter for the type
std::vector<double>. It is a workaround, to pass std::vector<double>
accross a DLL functions with C-linkage and use std::vector<double>
from C programs or foreign function interfaces. 

#+BEGIN_SRC cpp 
  // Handler for double vector 
  using hVectorD = void*;
  using pVectorD = std::vector<double>*;

  /** C-wrapper for vector<double> constructor */
  extern "C" __declspec(dllexport)
  hVectorD
  testlib_vectorD_make0(size_t n, double x){
     return new std::vector<double>(n, x);
  }
    ... ... ...     ... ... ...     ... ... ... 

  /** C-wrapper for vector<double> destructor */
  extern "C" __declspec(dllexport)
  void
  testlib_vectorD_delete(hVectorD hv){
    delete reinterpret_cast<pVectorD>(hv);
  }

  /** C-wrapepr for Linalg::norm function */
  extern "C" __declspec(dllexport)
  double
  testlib_vectorD_Linalg_norm(hVectorD hv){
     return Linalg::norm(*reinterpret_cast<pVectorD>(hv));
  }
    ... ... ...     ... ... ...     ... ... ... 

#+END_SRC





