DLL-Binary-Components-SharedLibraries.html

<div id="outline-container-orgf9a9a38" class="outline-4">
<h4 id="orgf9a9a38"><span class="section-number-4">1.2.4</span> C-interface of Namespace Linalg</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
<b>C-interface of Namespace Linalg</b> 
</p>

<p>
A C-interface is necessary for ensuring that the DLL can be called
from a C-program or a foreign function interface of a higher level
language. 
</p>

<ul class="org-ul">
<li>File: <b>testlib.hpp</b> =&gt; Function declaration.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">======= C-interface for Linalg namespace =========//</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">----- C-Wrappers for Linalg namespace ---- */</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Handle or opaque pointer for std::vector&lt;double&gt; */</span>
<span class="org-keyword">typedef</span> <span class="org-type">void</span>* <span class="org-type">hVectorD</span>;

<span class="org-keyword">extern</span> <span class="org-string">"C"</span>  <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">double</span> <span class="org-function-name">testlib_vectorD_Linalg_norm</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hVectorD</span> <span class="org-variable-name">hv</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">extern</span> <span class="org-string">"C"</span>  <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">void</span> <span class="org-function-name">testlib_vectorD_Linalg_printVector</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span>, <span class="org-type">hVectorD</span> <span class="org-variable-name">hv</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
The <b>extern "C"</b> statements are necessary to compile the functions with
<span class="underline">C-linkage</span>, it means without <span class="underline">name mangling</span> (aka name decoration). In
every C program, the function symbols are generally the same as their
names. However, as C++ supports templates and function overloading,
many functions can have the same, with different type signatures,
C++ compiler mangles or decorates function names with a different
schema to make the symbol unique. 
</p>

<p>
Functions with C-linkage, can only use C-compatible types or PODs
types (Plain Old Data). Therefore, they cannot use STL container,
std::vector, std::string and so on. 
</p>

<p>
The statement <code>__declspec(dllexport)</code> is necessary to make annotated
functions' symbols visible. On Unix-like systems and Linux, it is not
necessary as it is MSVC (cl.exe) compiler extension. 
</p>


<ul class="org-ul">
<li>File: <b>testlib.cpp</b> =&gt; C-interface function implementations.</li>
</ul>

<p>
The type synonym hVectorD is handle or a opaque poiter for the type
std::vector&lt;double&gt;. It is a workaround, to pass std::vector&lt;double&gt;
accross a DLL functions with C-linkage and use std::vector&lt;double&gt;
from C programs or foreign function interfaces. 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Handler for double vector </span>
<span class="org-keyword">using</span> <span class="org-type">hVectorD</span> = <span class="org-type">void</span>*;
<span class="org-keyword">using</span> <span class="org-type">pVectorD</span> = <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>*;

<span class="org-comment-delimiter">/** </span><span class="org-comment">C-wrapper for vector&lt;double&gt; constructor */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">hVectorD</span>
<span class="org-function-name">testlib_vectorD_make0</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">size_t</span> <span class="org-variable-name">n</span>, <span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-1">){</span>
   <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-constant">std</span>::vector<span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;(</span>n, x<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
  ... ... ...     ... ... ...     ... ... ... 

<span class="org-comment-delimiter">/** </span><span class="org-comment">C-wrapper for vector&lt;double&gt; destructor */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">void</span>
<span class="org-function-name">testlib_vectorD_delete</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hVectorD</span> <span class="org-variable-name">hv</span><span class="org-rainbow-delimiters-depth-1">){</span>
  <span class="org-keyword">delete</span> <span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">pVectorD</span><span class="org-rainbow-delimiters-depth-2">&gt;(</span>hv<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">C-wrapepr for Linalg::norm function */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">double</span>
<span class="org-function-name">testlib_vectorD_Linalg_norm</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hVectorD</span> <span class="org-variable-name">hv</span><span class="org-rainbow-delimiters-depth-1">){</span>
   <span class="org-keyword">return</span> <span class="org-constant">Linalg</span>::norm<span class="org-rainbow-delimiters-depth-2">(</span>*<span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">pVectorD</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span>hv<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
  ... ... ...     ... ... ...     ... ... ... 

</pre>
</div>
</div>
</div>
