DLL-Binary-Components-SharedLibraries.html





<div id="outline-container-org3087a08" class="outline-4">
<h4 id="org3087a08"><span class="section-number-4">1.2.5</span> Non-polymorphic Class - SampleClass</h4>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li>File: <b>testlib.hpp</b> =&gt; Class declaration.</li>
</ul>

<p>
In order to a class be exported in a Windows' shared library, it
requires the annotation <code>__declspec(dllexport)</code>.
</p>

<p>
Note: It will not be possible to compiled client program using this
class with a compiler different from the used to build the shared
library libtest.dll. It happens because, the C++ ABI - Application
Binary Interface is not the same accross different compilers. If the
DLL is compiled with MSVC, the only way to use this class from a
program compiled using MingW or even a different version of MSVC is
by using a C-interface (functions with C-linkage) and opaque
pointers (void* pointers). 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">======= Non-polymorphic class exported by DLL =========//</span>
<span class="org-preprocessor">#ifdef</span> __cplusplus
<span class="org-comment-delimiter">// </span><span class="org-comment">Non-polymorphic class </span>
<span class="org-keyword">class</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-type">SampleClass</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>:
        <span class="org-variable-name">SampleClass</span><span class="org-rainbow-delimiters-depth-2">()</span>;
        <span class="org-variable-name">SampleClass</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; name<span class="org-rainbow-delimiters-depth-2">)</span>;   
        ~<span class="org-variable-name">SampleClass</span><span class="org-rainbow-delimiters-depth-2">()</span>;
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span>;
        <span class="org-type">int</span> <span class="org-variable-name">get</span><span class="org-rainbow-delimiters-depth-2">()</span>;
        <span class="org-type">void</span> <span class="org-variable-name">set</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> n<span class="org-rainbow-delimiters-depth-2">)</span>;    
<span class="org-function-name">private</span>:
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">m_name</span>;
        <span class="org-type">int</span> <span class="org-variable-name">m_counter</span>;  
<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-preprocessor">#endif</span> 
</pre>
</div>

<ul class="org-ul">
<li>File: <b>testlib.cpp</b> =&gt; Class implementation.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">SampleClass</span>::SampleClass<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-1">)</span>
   : m_name<span class="org-rainbow-delimiters-depth-1">(</span>name<span class="org-rainbow-delimiters-depth-1">)</span>, m_counter<span class="org-rainbow-delimiters-depth-1">(</span>0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" Instance created with name = "</span> &lt;&lt; m_name &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-comment-delimiter">/** </span><span class="org-comment">Delegated constructor on right-hand-side */</span>
<span class="org-function-name">SampleClass</span>::SampleClass<span class="org-rainbow-delimiters-depth-1">()</span>: SampleClass<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"unnamed"</span><span class="org-rainbow-delimiters-depth-1">){}</span>   

<span class="org-function-name">SampleClass</span>::~SampleClass<span class="org-rainbow-delimiters-depth-1">(){</span>
    <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">text</span> = <span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"SampleClass =&gt; name = "</span><span class="org-rainbow-delimiters-depth-2">)</span> + m_name +  <span class="org-string">" deleted"</span>;
    DbgTrace<span class="org-rainbow-delimiters-depth-2">(</span>text<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-function-name">std</span>::string <span class="org-constant">SampleClass</span>::getName<span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">return</span> m_name;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-type">int</span> <span class="org-constant">SampleClass</span>::<span class="org-constant">SampleClass</span>::<span class="org-function-name">get</span><span class="org-rainbow-delimiters-depth-1">(){</span>        
    <span class="org-keyword">return</span> m_counter;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-type">void</span> <span class="org-constant">SampleClass</span>::<span class="org-function-name">set</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-1">){</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" Counter set to value = "</span> &lt;&lt; n &lt;&lt; <span class="org-constant">std</span>::endl;
    m_counter = n;
<span class="org-rainbow-delimiters-depth-1">}</span>   
</pre>
</div>
</div>
</div>
