DLL-Binary-Components-SharedLibraries.org
*** C-interface for SampleClass

 + File: *testlib.hpp* => Functions declarations. 

#+BEGIN_SRC cpp 
  /* ----- C-Wrappers for SampleClass namespace ---- */
  using hSampleClass = void*;

  /** Nullable constructor zero-arg constructor */
  extern "C" __declspec(dllexport)
  hSampleClass
  testlib_SampleClass_make0();

  /** Other constructor */
  EXPORT_C hSampleClass testlib_SampleClass_make1(const char* name);

  /** Destructor */
  EXPORT_C
  void
  testlib_SampleClass_delete(hSampleClass hnd);

  /** Wrapper for get method */
  EXPORT_C
  int
  testlib_SampleClass_get(hSampleClass hnd);

  /** Wrapper for set method */
  EXPORT_C
  void
  testlib_SampleClass_set(hSampleClass hnd, int n);

  EXPORT_C
  const char*
  testlib_SampleClass_getName(hSampleClass hnd);

#+END_SRC

 + File: *testlib.cpp* => Functions implementation. 

#+BEGIN_SRC cpp 
  using hSampleClass = void*;

  /** Nullable constructor zero-arg constructor */
  extern "C" __declspec(dllexport)
  hSampleClass
  testlib_SampleClass_make0(){
     return new SampleClass();
  }

  /** Other constructor */
  extern "C" __declspec(dllexport)
  hSampleClass
  testlib_SampleClass_make1(const char* name){
     return new SampleClass(name);
  }

  /** Destructor */
  extern "C" __declspec(dllexport)
  void
  testlib_SampleClass_delete(hSampleClass hnd){
     delete reinterpret_cast<SampleClass*>(hnd);
  }

  /** Wrapper for get method */
  extern "C" __declspec(dllexport)
  int
  testlib_SampleClass_get(hSampleClass hnd){
     return reinterpret_cast<SampleClass*>(hnd)->get();
  }
#+END_SRC

