DLL-Binary-Components-SharedLibraries.html

<div id="outline-container-orga8aa558" class="outline-4">
<h4 id="orga8aa558"><span class="section-number-4">1.2.6</span> C-interface for SampleClass</h4>
<div class="outline-text-4" id="text-1-2-6">
<ul class="org-ul">
<li>File: <b>testlib.hpp</b> =&gt; Functions declarations.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/* </span><span class="org-comment">----- C-Wrappers for SampleClass namespace ---- */</span>
<span class="org-keyword">using</span> <span class="org-type">hSampleClass</span> = <span class="org-type">void</span>*;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Nullable constructor zero-arg constructor */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">hSampleClass</span>
<span class="org-function-name">testlib_SampleClass_make0</span><span class="org-rainbow-delimiters-depth-1">()</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Other constructor */</span>
EXPORT_C <span class="org-type">hSampleClass</span> <span class="org-function-name">testlib_SampleClass_make1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Destructor */</span>
EXPORT_C
<span class="org-type">void</span>
<span class="org-function-name">testlib_SampleClass_delete</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hSampleClass</span> <span class="org-variable-name">hnd</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Wrapper for get method */</span>
EXPORT_C
<span class="org-type">int</span>
<span class="org-function-name">testlib_SampleClass_get</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hSampleClass</span> <span class="org-variable-name">hnd</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Wrapper for set method */</span>
EXPORT_C
<span class="org-type">void</span>
<span class="org-function-name">testlib_SampleClass_set</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hSampleClass</span> <span class="org-variable-name">hnd</span>, <span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-type">EXPORT_C</span>
<span class="org-keyword">const</span> <span class="org-type">char</span>*
testlib_SampleClass_getName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hSampleClass</span> <span class="org-variable-name">hnd</span><span class="org-rainbow-delimiters-depth-1">)</span>;

</pre>
</div>

<ul class="org-ul">
<li>File: <b>testlib.cpp</b> =&gt; Functions implementation.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">using</span> <span class="org-type">hSampleClass</span> = <span class="org-type">void</span>*;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Nullable constructor zero-arg constructor */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">hSampleClass</span>
<span class="org-function-name">testlib_SampleClass_make0</span><span class="org-rainbow-delimiters-depth-1">(){</span>
   <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">SampleClass</span><span class="org-rainbow-delimiters-depth-2">()</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Other constructor */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">hSampleClass</span>
<span class="org-function-name">testlib_SampleClass_make1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-1">){</span>
   <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">SampleClass</span><span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Destructor */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">void</span>
<span class="org-function-name">testlib_SampleClass_delete</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hSampleClass</span> <span class="org-variable-name">hnd</span><span class="org-rainbow-delimiters-depth-1">){</span>
   <span class="org-keyword">delete</span> <span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">SampleClass</span>*<span class="org-rainbow-delimiters-depth-2">&gt;(</span>hnd<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Wrapper for get method */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">int</span>
<span class="org-function-name">testlib_SampleClass_get</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hSampleClass</span> <span class="org-variable-name">hnd</span><span class="org-rainbow-delimiters-depth-1">){</span>
   <span class="org-keyword">return</span> <span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">SampleClass</span>*<span class="org-rainbow-delimiters-depth-2">&gt;(</span>hnd<span class="org-rainbow-delimiters-depth-2">)</span>-&gt;get<span class="org-rainbow-delimiters-depth-2">()</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
