DLL-Binary-Components-SharedLibraries.html

<div id="outline-container-org9cdbf21" class="outline-4">
<h4 id="org9cdbf21"><span class="section-number-4">1.2.7</span> Polymorphic class InterfaceClass</h4>
<div class="outline-text-4" id="text-1-2-7">
<ul class="org-ul">
<li>File: <b>testlib.hpp</b> =&gt; Class declaration.</li>
</ul>

<p>
As the name implies, this class is an interface class, which is a
class containing only pure virtual functions (abstract methods). As a
result, it is declared only in the header file and cannot be
instatiated directly. 
</p>

<p>
This class uses only C-types to be binary compatible with different
compilers, if it used STL containers such as string or any other
non-compatible C-type, it would not be possible to compile a C++
program using Mingw/GCC against this DLL built with MSVC.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Polymorphic Interface class binary compatible across different</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">compilers as it does not use any STL container on the interface.</span>
<span class="org-preprocessor">#ifdef</span> __cplusplus
<span class="org-keyword">struct</span> <span class="org-type">InterfaceClass</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-comment-delimiter">/* </span><span class="org-comment">Returns class unique ID */</span>
        <span class="org-keyword">virtual</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getID</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> = 0;
        <span class="org-comment-delimiter">/** </span><span class="org-comment">Set class internal state */</span>
        <span class="org-keyword">virtual</span> <span class="org-type">void</span> <span class="org-function-name">setName</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span> = 0;
        <span class="org-keyword">virtual</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> = 0;

        <span class="org-comment-delimiter">/** </span><span class="org-comment">Virtual constructor */</span>
        <span class="org-keyword">virtual</span> ~<span class="org-function-name">InterfaceClass</span><span class="org-rainbow-delimiters-depth-2">()</span> = <span class="org-keyword">default</span>;
        <span class="org-comment-delimiter">// </span><span class="org-comment">virtual ~InterfaceClass();</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-preprocessor">#else</span>
<span class="org-preprocessor">  #define</span> <span class="org-variable-name">InterfaceClass</span> <span class="org-type">void</span> 
<span class="org-preprocessor">#endif</span> 
</pre>
</div>

<ul class="org-ul">
<li>File: <b>testlib.cpp</b> =&gt; class ImplementationA of interface InterfaceClass.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">class</span> <span class="org-type">ImplementationA</span>: <span class="org-keyword">public</span> <span class="org-type">InterfaceClass</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
    <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">m_name</span>;
<span class="org-function-name">public</span>:
    <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">class_id</span> = <span class="org-string">"ImplementationA"</span>;

    <span class="org-function-name">ImplementationA</span><span class="org-rainbow-delimiters-depth-2">()</span>: m_name<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Unammed-A"</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-function-name">ImplementationA</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span>
       : m_name<span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">){}</span> 
    ~<span class="org-function-name">ImplementationA</span><span class="org-rainbow-delimiters-depth-2">(){</span>
         <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [INFO] ImplementationA deleted =&gt; name = "</span>
                   &lt;&lt; m_name
                   &lt;&lt; <span class="org-string">" ; type = "</span> &lt;&lt; class_id
                   &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getID</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span>     
        <span class="org-keyword">return</span> class_id;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-type">void</span> <span class="org-function-name">setName</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        m_name = name;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">return</span> m_name.c_str<span class="org-rainbow-delimiters-depth-3">()</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<ul class="org-ul">
<li>File: <b>testlib.cpp</b> =&gt; class ImplementationB of interface InterfaceClass.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">class</span> <span class="org-type">ImplementationB</span>: <span class="org-keyword">public</span> <span class="org-type">InterfaceClass</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
    <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">m_name</span>;
<span class="org-function-name">public</span>:
    <span class="org-keyword">static</span> <span class="org-keyword">constexpr</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">class_id</span> = <span class="org-string">"ImplementationB"</span>;

    <span class="org-function-name">ImplementationB</span><span class="org-rainbow-delimiters-depth-2">()</span>: m_name<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Unammed-B"</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-function-name">ImplementationB</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span>
       : m_name<span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">){}</span> 
    ~<span class="org-function-name">ImplementationB</span><span class="org-rainbow-delimiters-depth-2">(){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [INFO] ImplementationB deleted =&gt; name = "</span>
                  &lt;&lt; m_name
                  &lt;&lt; <span class="org-string">" ; type = "</span> &lt;&lt; class_id
                  &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getID</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-keyword">const</span> <span class="org-rainbow-delimiters-depth-2">{</span>     
            <span class="org-keyword">return</span> class_id;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-type">void</span> <span class="org-function-name">setName</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
            m_name = name;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-function-name">getName</span><span class="org-rainbow-delimiters-depth-2">()</span> <span class="org-rainbow-delimiters-depth-2">{</span>
            <span class="org-keyword">return</span> m_name.c_str<span class="org-rainbow-delimiters-depth-3">()</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

</pre>
</div>

<ul class="org-ul">
<li>File: <b>testlib.hpp</b> =&gt; C-interface and factory function to load
implementations from the DLL.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/** </span><span class="org-comment">Factory function */</span>
EXPORT_C <span class="org-type">InterfaceClass</span>* <span class="org-function-name">teslib_InterfaceClass_factory</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">class_id</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">C-wrapper for destructor */</span>
EXPORT_C <span class="org-type">void</span> <span class="org-function-name">testlib_InterfaceClass_delete</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinst</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">C-wrapper for getID method */</span>
<span class="org-type">EXPORT_C</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* testlib_InterfaceClass_getID<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinst</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-type">EXPORT_C</span> <span class="org-type">void</span> <span class="org-function-name">testlib_InterfaceClass_setName</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinst</span>, <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-type">EXPORT_C</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* testlib_InterfaceClass_getName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinst</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<ul class="org-ul">
<li>File: <b>testlib.cpp</b> =&gt; C-interfaces and factory functions
definitions.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">EXPORT_C <span class="org-type">InterfaceClass</span>*
<span class="org-function-name">teslib_InterfaceClass_factory</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">class_id</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">auto</span> <span class="org-variable-name">s</span> = <span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-2">(</span>class_id<span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>s == <span class="org-string">"ImplementationA"</span><span class="org-rainbow-delimiters-depth-2">)</span>
            <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">ImplementationA</span><span class="org-rainbow-delimiters-depth-2">()</span>;
    <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>s == <span class="org-string">"ImplementationB"</span><span class="org-rainbow-delimiters-depth-2">)</span>
            <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">ImplementationB</span><span class="org-rainbow-delimiters-depth-2">()</span>;
    <span class="org-keyword">return</span> <span class="org-constant">nullptr</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

EXPORT_C <span class="org-type">void</span> <span class="org-function-name">testlib_InterfaceClass_delete</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinst</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">delete</span> hinst;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-type">EXPORT_C</span>
<span class="org-keyword">const</span> <span class="org-type">char</span>* testlib_InterfaceClass_getID<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinst</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">return</span> hinst-&gt;getID<span class="org-rainbow-delimiters-depth-2">()</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-type">EXPORT_C</span>
<span class="org-type">void</span> <span class="org-function-name">testlib_InterfaceClass_setName</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinst</span>, <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">name</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    hinst-&gt;setName<span class="org-rainbow-delimiters-depth-2">(</span>name<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-type">EXPORT_C</span>
<span class="org-keyword">const</span> <span class="org-type">char</span>* testlib_InterfaceClass_getName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinst</span><span class="org-rainbow-delimiters-depth-1">){</span>
    <span class="org-keyword">return</span> hinst-&gt;getName<span class="org-rainbow-delimiters-depth-2">()</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
