DLL-Binary-Components-SharedLibraries.html
<div id="outline-container-orgbd82f75" class="outline-4">
<h4 id="orgbd82f75"><span class="section-number-4">1.2.8</span> DLL startup function DLLMain</h4>
<div class="outline-text-4" id="text-1-2-8">
<p>
When a Windows shared library is loaded at compile-time or at runtime
by some process, the function DLLMain is always invoked, it is similar
to the function main() from an executable. 
</p>

<p>
Note: logging statements with printf, std::cout, std::cerr will not
printed if the DLL is loaded by some non-console program, a program
compiled to the <span class="underline">window subsystem</span>. Therefore, the easiest way to log is
to use the OutputDebugString function which output can viewed by the
DebugView sysinternal tool. 
</p>


<ul class="org-ul">
<li>File: <b>testlib.cpp</b> =&gt; DLL main function.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/** </span><span class="org-comment">- DLL Entry point - main function of DLL which is executed when</span>
<span class="org-comment">    the DLL is loaded by some process.</span>
<span class="org-comment"> */</span>
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
BOOL <span class="org-type">APIENTRY</span> <span class="org-function-name">DllMain</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">HINSTANCE</span> <span class="org-variable-name">hInst</span>, <span class="org-type">DWORD</span> <span class="org-variable-name">reason</span>, <span class="org-type">LPVOID</span> <span class="org-variable-name">lpReserved</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
   <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">text</span> =
           <span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"DLL Loaded into the process =&gt; PID = "</span><span class="org-rainbow-delimiters-depth-2">)</span>
           + <span class="org-constant">std</span>::to_string<span class="org-rainbow-delimiters-depth-2">(</span>::GetCurrentProcessId<span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;
   WindbgTrace<span class="org-rainbow-delimiters-depth-2">(</span>text<span class="org-rainbow-delimiters-depth-2">)</span>;
   DbgTrace<span class="org-rainbow-delimiters-depth-2">(</span>text<span class="org-rainbow-delimiters-depth-2">)</span>;      
    <span class="org-keyword">switch</span> <span class="org-rainbow-delimiters-depth-2">(</span>reason<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-keyword">case</span> DLL_PROCESS_ATTACH:
        WindbgTrace<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"DLL attached to process"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
        DbgTrace<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"DLL attached to process."</span><span class="org-rainbow-delimiters-depth-3">)</span>;           
      <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> DLL_PROCESS_DETACH:
        WindbgTrace<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"=&gt; DLL detached."</span><span class="org-rainbow-delimiters-depth-3">)</span>;
        DbgTrace<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"=&gt; DLL attached"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
      <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> DLL_THREAD_ATTACH:
        WindbgTrace<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"DLL attached to thread"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
        DbgTrace<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"DLL detached to thread."</span><span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> DLL_THREAD_DETACH:
        WindbgTrace<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"DLL detached from thread"</span><span class="org-rainbow-delimiters-depth-3">)</span>;
        DbgTrace<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"DLL detached from thread."</span><span class="org-rainbow-delimiters-depth-3">)</span>;
      <span class="org-keyword">break</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

  <span class="org-keyword">return</span> TRUE;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Another more portable way to peform some way action when the DLL is
loaded by a process or unloaded is to use a static object. The startup
task is executed int the object's constructor and the finalization
task, which happens when the process ends, is executed at object's
destructor. 
</p>

<ul class="org-ul">
<li>File: <b>testlib.cpp</b> =&gt; Static Object for replacing DLLMain</li>
</ul>

<p>
The class _StaticObject and a static instance of it is defined within
an anonymous namespace to make them private to the compilation unit
testlib.cpp and not allow them to be used from anywhere else. 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Class private to this compilation unit - cannot be accessed from</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">any other file</span>
<span class="org-keyword">namespace</span> <span class="org-rainbow-delimiters-depth-1">{</span>
   <span class="org-keyword">class</span> <span class="org-type">_StaticObject</span><span class="org-rainbow-delimiters-depth-2">{</span>     
   <span class="org-keyword">public</span>:
       <span class="org-keyword">using</span> <span class="org-type">Action</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-4">()</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>;
       <span class="org-type">Action</span> <span class="org-variable-name">m_end</span>;

       <span class="org-function-name">_StaticObject</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">Action</span> <span class="org-variable-name">init</span>, <span class="org-type">Action</span> <span class="org-variable-name">end</span><span class="org-rainbow-delimiters-depth-3">)</span>
               :  m_end<span class="org-rainbow-delimiters-depth-3">(</span>end<span class="org-rainbow-delimiters-depth-3">)</span>
       <span class="org-rainbow-delimiters-depth-3">{</span>
               init<span class="org-rainbow-delimiters-depth-4">()</span>;
       <span class="org-rainbow-delimiters-depth-3">}</span>
       ~<span class="org-function-name">_StaticObject</span><span class="org-rainbow-delimiters-depth-3">(){</span> m_end<span class="org-rainbow-delimiters-depth-4">()</span>; <span class="org-rainbow-delimiters-depth-3">}</span>
   <span class="org-rainbow-delimiters-depth-2">}</span>;

   <span class="org-comment-delimiter">// </span><span class="org-comment">Static object for replacing DLLMain </span>
   <span class="org-keyword">auto</span> <span class="org-variable-name">initDLL</span> = _StaticObject<span class="org-rainbow-delimiters-depth-2">(</span>
      <span class="org-rainbow-delimiters-depth-3">[]{</span>
            <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [StaticObject] =&gt; Initialize DLL"</span>
                       &lt;&lt; <span class="org-constant">std</span>::endl;                        
      <span class="org-rainbow-delimiters-depth-3">}</span>,
      <span class="org-rainbow-delimiters-depth-3">[]{</span>   
           <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" [StaticObject] =&gt; Shutdown DLL"</span>
                     &lt;&lt; <span class="org-constant">std</span>::endl;                              
      <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge33c919" class="outline-4">
<h4 id="orge33c919"><span class="section-number-4">1.2.9</span> DLL entry point for run32dll.exe</h4>
<div class="outline-text-4" id="text-1-2-9">
<p>
This function is a DLL entry point for the Windows program
rundll32.exe which can execute this function with: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">$ rundll32.exe testlib.dll,entryPoint1
$ rundll32.exe testlib.dll,entryPoint1 arg0 arg1 <span class="org-type">arg2</span> ... <span class="org-variable-name">argn</span> 
</pre>
</div>

<p>
When the DLL testlib.dll is run with run32dll calling the function
entryPoint1, it will display a message box. 
</p>

<p>
Note: It is an optional function which could be used for installing
the DLL in the system or creating some entry in Windows' registry. 
</p>

<ul class="org-ul">
<li>File: <b>testlib.cpp</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-keyword">__declspec</span><span class="org-rainbow-delimiters-depth-1">(</span>dllexport<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">void</span> <span class="org-function-name">entryPoint1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">HWND</span> <span class="org-variable-name">hwn</span>, <span class="org-type">HINSTANCE</span> <span class="org-variable-name">hinst</span>, <span class="org-type">LPSTR</span> <span class="org-variable-name">cmdLine</span>, <span class="org-type">int</span> <span class="org-variable-name">nCmdShow</span><span class="org-rainbow-delimiters-depth-1">){</span>  
     DbgDisp<span class="org-rainbow-delimiters-depth-2">(</span>cmdLine<span class="org-rainbow-delimiters-depth-2">)</span>;
     OutputDebugString<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Rudll32 called entryPoint1()"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
     MessageBoxA<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">NULL</span>, <span class="org-string">"DLL ENTRY POINT"</span>, <span class="org-string">"Entry point 1"</span>, 0<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
