DLL-Binary-Components-SharedLibraries.html
<div id="outline-container-org91a7c35" class="outline-4">
<h4 id="org91a7c35"><span class="section-number-4">1.2.10</span> C++ Client program - client1.cpp</h4>
<div class="outline-text-4" id="text-1-2-10">
<ul class="org-ul">
<li>File: <a href="src/dlls/example-windows1/client1.cpp">file:src/dlls/example-windows1/client1.cpp</a></li>
</ul>

<p>
<b>File client1.cpp</b>
</p>

<p>
Includes: 
</p>

<ul class="org-ul">
<li>Note: (#include "testlib.hpp") a header file between quotes,
indicates to the compiler that the header is in the same directory
as the source file client1.cpp.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">ostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">vector</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">string</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-preprocessor">#include</span> <span class="org-string">"testlib.hpp"</span>
</pre>
</div>

<p>
Declaration of functions with C-linkages not declarated in the header
testlib.hpp
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-type">hVectorD</span> <span class="org-function-name">testlib_vectorD_make0</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">size_t</span> <span class="org-variable-name">n</span>, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-type">hVectorD</span> <span class="org-function-name">testlib_vectorD_make1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">size_t</span> <span class="org-variable-name">n</span>, <span class="org-type">double</span> <span class="org-variable-name">array</span> <span class="org-rainbow-delimiters-depth-2">[]</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-type">void</span> <span class="org-function-name">testlib_vectorD_delete</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">hVectorD</span> <span class="org-variable-name">hv</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Main function - Experiment 1 and Experiment 2:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#if</span><span class="org-negation-char"><span class="org-preprocessor">n</span></span><span class="org-preprocessor">def</span> DISABLE
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"\n=== EXPERIMENT 1 ===&gt; Import C++ functions from DLL"</span> &lt;&lt; <span class="org-constant">std</span>::endl;

DbgTrace<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Main process starts here."</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> xs<span class="org-rainbow-delimiters-depth-1">{</span>1.0, 2.0, 3.0, 4.0, 5.0<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">" =&gt; Linalg::norm(xs) "</span> &lt;&lt; <span class="org-constant">Linalg</span>::norm<span class="org-rainbow-delimiters-depth-1">(</span>xs<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"=&gt; xs = "</span>; <span class="org-constant">Linalg</span>::printVector<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::cout, xs<span class="org-rainbow-delimiters-depth-1">)</span>; <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;

<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"=== EXPERIMENT 2 ===&gt; Import class from DLL"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-keyword">auto</span> <span class="org-variable-name">cls</span> = SampleClass<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Dummy"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
cls.set<span class="org-rainbow-delimiters-depth-1">(</span>100<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"cls.getName() = "</span> &lt;&lt; cls.getName<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"    cls.get() = "</span> &lt;&lt; cls.get<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-preprocessor">#endif</span> <span class="org-comment-delimiter">// </span><span class="org-comment">-- eof DISABLE flag</span>
</pre>
</div>

<p>
Main Function - Experiment 3 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">//</span><span class="org-comment">=========&gt;&gt; Load functions and classes using C-interface ==============//</span>

<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"\n== EPERIMENT 3 ===&gt; Import C-functions from DLL - C-interface"</span> &lt;&lt; <span class="org-constant">std</span>::endl;

<span class="org-type">double</span> <span class="org-variable-name">arr</span> <span class="org-rainbow-delimiters-depth-1">[]</span> = <span class="org-rainbow-delimiters-depth-1">{</span>1, 2, 3, 4, 5<span class="org-rainbow-delimiters-depth-1">}</span>;
<span class="org-type">hVectorD</span> <span class="org-variable-name">v1</span> = testlib_vectorD_make1<span class="org-rainbow-delimiters-depth-1">(</span>5, arr<span class="org-rainbow-delimiters-depth-1">)</span>;
testlib_vectorD_Linalg_printVector<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"v1"</span>, v1<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"norm(v1) = "</span> &lt;&lt; testlib_vectorD_Linalg_norm<span class="org-rainbow-delimiters-depth-1">(</span>v1<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;

testlib_vectorD_delete<span class="org-rainbow-delimiters-depth-1">(</span>v1<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Main Functions - Experiment 4 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"\n== EPERIMENT 4 ===&gt; Non-polymorphic class with C-interface "</span> &lt;&lt; <span class="org-constant">std</span>::endl;

<span class="org-type">hSampleClass</span> <span class="org-variable-name">hcls</span> = testlib_SampleClass_make1<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"[EXPERIMENT4]ClassHandle-OOP-C-API"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"[EXPERIMENT 4] hcls.getName() = "</span> &lt;&lt; testlib_SampleClass_getName<span class="org-rainbow-delimiters-depth-1">(</span>hcls<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;
testlib_SampleClass_set<span class="org-rainbow-delimiters-depth-1">(</span>hcls, 100<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"[EXPERIMENT 4] hcls.get()     = "</span> &lt;&lt; testlib_SampleClass_get<span class="org-rainbow-delimiters-depth-1">(</span>hcls<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;
testlib_SampleClass_set<span class="org-rainbow-delimiters-depth-1">(</span>hcls, 200<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"[EXPERIMENT 4] hcls.get()     = "</span> &lt;&lt; testlib_SampleClass_get<span class="org-rainbow-delimiters-depth-1">(</span>hcls<span class="org-rainbow-delimiters-depth-1">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;

testlib_SampleClass_delete<span class="org-rainbow-delimiters-depth-1">(</span>hcls<span class="org-rainbow-delimiters-depth-1">)</span>;   
</pre>
</div>

<p>
Main Functions - Experiment 5 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">"\n== EPERIMENT 5 ===&gt; Load polymorphic classes from DLL "</span> &lt;&lt; <span class="org-constant">std</span>::endl;

<span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinstA</span> = teslib_InterfaceClass_factory<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"ImplementationA"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">InterfaceClass</span>* <span class="org-variable-name">hinstB</span> = teslib_InterfaceClass_factory<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"ImplementationB"</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">" =&gt; hinstA-&gt;getID() = "</span> &lt;&lt; hinstA-&gt;getID<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">" =&gt; hinstA-&gt;getID() = "</span> &lt;&lt; hinstB-&gt;getID<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
hinstA-&gt;setName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"ClassA-implA"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
hinstB-&gt;setName<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"ClassB-implB"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">" =&gt; hinstA-&gt;getName() = "</span> &lt;&lt; hinstA-&gt;getID<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">" =&gt; hinstB-&gt;getName() = "</span> &lt;&lt; hinstB-&gt;getID<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; <span class="org-constant">std</span>::endl;

<span class="org-comment-delimiter">// </span><span class="org-comment">Note: If delete is used directly to delete hinstA and hinstB,</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">a segmentatin fault will happen whenc compiling with Mingw/GCC</span>
testlib_InterfaceClass_delete<span class="org-rainbow-delimiters-depth-1">(</span>hinstA<span class="org-rainbow-delimiters-depth-1">)</span>;
testlib_InterfaceClass_delete<span class="org-rainbow-delimiters-depth-1">(</span>hinstB<span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-function-name">std</span>::cout &lt;&lt; <span class="org-string">" [INFO] After deleting instances"</span> &lt;&lt; <span class="org-constant">std</span>::endl;

DbgTrace<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Program ended OK."</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
<b>Compile and run client code with MSVC</b>
</p>

<p>
Note: Both the DLL and the client code are compiled with MSVC-2017 64
bits target.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cl.exe /EHsc client.cpp /nologo /Fe:client1.exe testlib.lib &amp;&amp; client1.exe

<span class="org-comment-delimiter"># </span><span class="org-comment">Output: </span>
client.cpp
   Creating library client1.lib and object client1.exp
 [StaticObject] =&gt; Initialize DLL
<span class="org-function-name">testlib.cpp</span>:39: &lt;DllMain&gt; DLL Loaded into the process =&gt; PID = 1112
<span class="org-function-name">testlib.cpp</span>:45: &lt;DllMain&gt; DLL attached to process.

=== EXPERIMENT 1 ===&gt; Import C++ functions from DLL
<span class="org-function-name">client.cpp</span>:33: &lt;main&gt; Main process starts here.
 =&gt; Linalg::norm(xs) 7.4162
=&gt; xs = [5]( 1, 2, 3, 4, 5,  )
=== EXPERIMENT 2 ===&gt; Import class from DLL
 Instance created with name = Dummy
 Counter set to value = 100
<span class="org-function-name">cls.getName</span>() = Dummy
    cls.get() = 100

== EPERIMENT 3 ===&gt; Import C-functions from DLL - C-interface
v1 = [5]( 1, 2, 3, 4, 5,  )
<span class="org-function-name">norm</span>(v1) = 7.4162

== EPERIMENT 4 ===&gt; Non-polymorphic class with C-interface 
 Instance created with name = [EXPERIMENT4]ClassHandle-OOP-C-API
[EXPERIMENT 4] hcls.getName() = [EXPERIMENT4]ClassHandle-OOP-C-API
 Counter set to value = 100
[EXPERIMENT 4] hcls.get()     = 100
 Counter set to value = 200
[EXPERIMENT 4] hcls.get()     = 200
<span class="org-function-name">testlib.cpp</span>:159: &lt;SampleClass::~SampleClass&gt; SampleClass =&gt; name = [EXPERIMENT4]ClassHandle-OOP-C-API deleted

== EPERIMENT 5 ===&gt; Load polymorphic classes from DLL 
 =&gt; hinstA-&gt;getID() = ImplementationA
 =&gt; hinstA-&gt;getID() = ImplementationB
 =&gt; hinstA-&gt;getName() = ImplementationA
 =&gt; hinstB-&gt;getName() = ImplementationB
 [INFO] ImplementationA deleted =&gt; name = ClassA-implA ; <span class="org-builtin">type</span> = ImplementationA
 [INFO] ImplementationB deleted =&gt; name = ClassB-implB ; <span class="org-builtin">type</span> = ImplementationB
 [INFO] After deleting instances
<span class="org-function-name">client.cpp</span>:87: &lt;main&gt; Program ended OK.
<span class="org-function-name">testlib.cpp</span>:159: &lt;SampleClass::~SampleClass&gt; SampleClass =&gt; name = Dummy deleted
<span class="org-function-name">testlib.cpp</span>:39: &lt;DllMain&gt; DLL Loaded into the process =&gt; PID = 1112
<span class="org-function-name">testlib.cpp</span>:49: &lt;DllMain&gt; =&gt; DLL attached
 [StaticObject] =&gt; Shutdown DLL

</pre>
</div>

<p>
<b>[FAILURE] ABI - Issue - Compile with Mingw client1.cpp against testlib.dll built with MSVC</b>
</p>

<p>
The client code is compiled with Mingw and the library was built with
MSVC-2017 for 64 bits target.
</p>

<p>
Build and run client [FAILURE]:
</p>

<div class="org-src-container">
<pre class="src src-cpp">$ g++ client1.cpp -g -o <span class="org-keyword">client1-gcc.exe</span> -std=c++14 testlib.dll  &amp;&amp; client1-gcc.exe
<span class="org-function-name">C</span>:\Users\archbox\AppData\Local\Temp\cckNg9eZ.o: In function `main<span class="org-warning">'</span>:
<span class="org-function-name">client1.cpp</span>:35: undefined reference to `<span class="org-constant">Linalg</span>::norm<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span>, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-keyword">const</span>&amp;<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-warning">'</span>
<span class="org-function-name">client1.cpp</span>:36: undefined reference to `<span class="org-constant">Linalg</span>::printVector<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp;, <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span>, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span>&amp;<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-warning">'</span>
<span class="org-function-name">client1.cpp</span>:39: undefined reference to `<span class="org-constant">SampleClass</span>::SampleClass<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-constant">__cxx11</span>::<span class="org-type">basic_string</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">char</span>, <span class="org-constant">std</span>::<span class="org-type">char_traits</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>, <span class="org-constant">std</span>::<span class="org-type">allocator</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-keyword">const</span>&amp;<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-warning">'</span>
<span class="org-function-name">client1.cpp</span>:40: undefined reference to `<span class="org-constant">SampleClass</span>::set<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-warning">'</span>
<span class="org-function-name">client1.cpp</span>:41: undefined reference to `<span class="org-constant">SampleClass</span>::getName<span class="org-rainbow-delimiters-depth-1">[</span>abi:cxx11<span class="org-rainbow-delimiters-depth-1">]()</span> <span class="org-keyword">const</span><span class="org-warning">'</span>
<span class="org-function-name">client1.cpp</span>:42: undefined reference to `<span class="org-constant">SampleClass</span>::get<span class="org-rainbow-delimiters-depth-1">()</span><span class="org-warning">'</span>
<span class="org-function-name">client1.cpp</span>:39: undefined reference to `<span class="org-constant">SampleClass</span>::~SampleClass<span class="org-rainbow-delimiters-depth-1">()</span><span class="org-warning">'</span>
<span class="org-function-name">client1.cpp</span>:39: undefined reference to `<span class="org-constant">SampleClass</span>::~SampleClass<span class="org-rainbow-delimiters-depth-1">()</span><span class="org-warning">'</span>
<span class="org-function-name">collect2.exe</span>: error: ld returned 1 exit status
Compilation <span class="org-compilation-error">exited abnormally</span> with code <span class="org-compilation-error">1</span> at Sun Dec 16 17:41:47
</pre>
</div>

<p>
The compilation fails because C++ does not have a standard and stable
ABI - Application Binary Interface, as a result, it is not possible to
use an object-code (here - any type of compiled code) built by a
different compiler than the current one. The ABI comprises the name
mangling schema or name decoration schema which is compiler-dependent,
padding, class memory layout and so on. In addition to ABI issues, the
STL - Standard Template Library implementations may not be compatible
and also not be the same across different compilers. 
</p>

<p>
The only way to ensure that a DLL can work with all possible compilers
is to use a functions with C-linkage (extern "C") with opaque pointers
(void*) for passing around classes and wrapped STL containers. Classes
can be used by different compilers, only if they are interface classes
(classes with only pure virtual functions) containing only
C-compatible types in the declaration. 
</p>


<p>
<b>Compile with Mingw client1.cpp against testlib.dll built with MSVC</b>
</p>

<p>
The compilation works when compiling with the custom flag -DDISABLE.
The directive <span class="underline">#ifndef DISABLE &#x2026; #endif</span> removes all usages of the
namespace Linalg and the class SampleClass. This flag makes main the
function use only functions with C-linkage and the interface class
InterfaceClass.
</p>

<div class="org-src-container">
<pre class="src src-cpp">$ g++ client.cpp -g -o <span class="org-keyword">client-gcc.exe</span> -std=c++14 testlib.dll -DDISABLE   &amp;&amp; client-gcc.exe

   <span class="org-rainbow-delimiters-depth-1">[</span>StaticObject<span class="org-rainbow-delimiters-depth-1">]</span> =&gt; Initialize DLL
  testlib.cpp:39: <span class="org-rainbow-delimiters-depth-1">&lt;</span>DllMain<span class="org-rainbow-delimiters-depth-1">&gt;</span> DLL Loaded into the process =&gt; PID = 5724
  testlib.cpp:45: <span class="org-rainbow-delimiters-depth-1">&lt;</span>DllMain<span class="org-rainbow-delimiters-depth-1">&gt;</span> DLL attached to process.

  == EPERIMENT 3 ===&gt; Import C-functions from DLL - C-interface
  v1 = <span class="org-rainbow-delimiters-depth-1">[</span>5<span class="org-rainbow-delimiters-depth-1">](</span> 1, 2, 3, 4, 5,  <span class="org-rainbow-delimiters-depth-1">)</span>
  norm<span class="org-rainbow-delimiters-depth-1">(</span>v1<span class="org-rainbow-delimiters-depth-1">)</span> = 7.4162

  == EPERIMENT 4 ===&gt; Non-polymorphic <span class="org-keyword">class</span> with C-interface 
   Instance created with name = <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">EXPERIMENT4</span><span class="org-rainbow-delimiters-depth-1">]</span>ClassHandle-OOP-C-API
  <span class="org-rainbow-delimiters-depth-1">[</span>EXPERIMENT 4<span class="org-rainbow-delimiters-depth-1">]</span> hcls.getName<span class="org-rainbow-delimiters-depth-1">()</span> = <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">EXPERIMENT4</span><span class="org-rainbow-delimiters-depth-1">]</span>ClassHandle-OOP-C-API
   Counter set to value = 100
  <span class="org-rainbow-delimiters-depth-1">[</span>EXPERIMENT 4<span class="org-rainbow-delimiters-depth-1">]</span> hcls.get<span class="org-rainbow-delimiters-depth-1">()</span>     = 100
   Counter set to value = 200
  <span class="org-rainbow-delimiters-depth-1">[</span>EXPERIMENT 4<span class="org-rainbow-delimiters-depth-1">]</span> hcls.get<span class="org-rainbow-delimiters-depth-1">()</span>     = 200
  testlib.cpp:159: <span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">SampleClass</span>::~SampleClass<span class="org-rainbow-delimiters-depth-1">&gt;</span> SampleClass =&gt; name = <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">EXPERIMENT4</span><span class="org-rainbow-delimiters-depth-1">]</span>ClassHandle-OOP-C-API deleted

  == EPERIMENT 5 ===&gt; Load polymorphic classes from DLL 
   =&gt; hinstA-&gt;getID<span class="org-rainbow-delimiters-depth-1">()</span> = ImplementationA
   =&gt; hinstA-&gt;getID<span class="org-rainbow-delimiters-depth-1">()</span> = ImplementationB
   =&gt; hinstA-&gt;getName<span class="org-rainbow-delimiters-depth-1">()</span> = ImplementationA
   =&gt; hinstB-&gt;getName<span class="org-rainbow-delimiters-depth-1">()</span> = ImplementationB
   <span class="org-rainbow-delimiters-depth-1">[</span>INFO<span class="org-rainbow-delimiters-depth-1">]</span> ImplementationA deleted =&gt; name = ClassA-implA ; type = ImplementationA
   <span class="org-rainbow-delimiters-depth-1">[</span>INFO<span class="org-rainbow-delimiters-depth-1">]</span> ImplementationB deleted =&gt; name = ClassB-implB ; type = ImplementationB
   <span class="org-rainbow-delimiters-depth-1">[</span>INFO<span class="org-rainbow-delimiters-depth-1">]</span> After deleting instances
  client.cpp:87: <span class="org-rainbow-delimiters-depth-1">&lt;</span>main<span class="org-rainbow-delimiters-depth-1">&gt;</span> Program ended OK.
  testlib.cpp:39: <span class="org-rainbow-delimiters-depth-1">&lt;</span>DllMain<span class="org-rainbow-delimiters-depth-1">&gt;</span> DLL Loaded into the process =&gt; PID = 5724
  testlib.cpp:49: <span class="org-rainbow-delimiters-depth-1">&lt;</span>DllMain<span class="org-rainbow-delimiters-depth-1">&gt;</span> =&gt; DLL attached
   <span class="org-rainbow-delimiters-depth-1">[</span>StaticObject<span class="org-rainbow-delimiters-depth-1">]</span> =&gt; Shutdown DLL
</pre>
</div>
</div>
</div>
</div>
